["After the French were expelled, power was seized in 1805 by Muhammad Ali Pasha, an Albanian military commander of the Ottoman army in Egypt. While he carried the title of viceroy of Egypt, his subordination to the Ottoman porte was merely nominal.[citation needed] Muhammad Ali massacred the Mamluks and established a dynasty that was to rule Egypt until the revolution of 1952.\n", "Israel re-iterated that the Straits of Tiran closure was a Casus belli. This prompted the beginning of the Third Arab Israeli War (Six-Day War) in which Israel attacked Egypt, and occupied Sinai Peninsula and the Gaza Strip, which Egypt had occupied since the 1948 Arab–Israeli War. During the 1967 war, an Emergency Law was enacted, and remained in effect until 2012, with the exception of an 18-month break in 1980/81.[62] Under this law, police powers were extended, constitutional rights suspended and censorship legalised.[citation needed]\n", "During Mubarak's reign, the political scene was dominated by the National Democratic Party, which was created by Sadat in 1978. It passed the 1993 Syndicates Law, 1995 Press Law, and 1999 Nongovernmental Associations Law which hampered freedoms of association and expression by imposing new regulations and draconian penalties on violations.[citation needed] As a result, by the late 1990s parliamentary politics had become virtually irrelevant and alternative avenues for political expression were curtailed as well.[73]\n", "The Egyptian military has dozens of factories manufacturing weapons as well as consumer goods. The Armed Forces' inventory includes equipment from different countries around the world. Equipment from the former Soviet Union is being progressively replaced by more modern US, French, and British equipment, a significant portion of which is built under license in Egypt, such as the M1 Abrams tank.[citation needed] Relations with Russia have improved significantly following Mohamed Morsi's removal[152] and both countries have worked since then to strengthen military[153] and trade ties[154] among other aspects of bilateral co-operation. Relations with China have also improved considerably. In 2014, Egypt and China established a bilateral \"comprehensive strategic partnership\".[155] In July 2019, UN ambassadors of 37 countries, including Egypt, have signed a joint letter to the UNHRC defending China's treatment of Uyghurs in the Xinjiang region.[156]\n", "Foreign direct investment (FDI) in Egypt increased considerably before the removal of Hosni Mubarak, exceeding $6 billion in 2006, due to economic liberalisation and privatisation measures taken by minister of investment Mahmoud Mohieddin.[citation needed] Since the fall of Hosni Mubarak in 2011, Egypt has experienced a drastic fall in both foreign investment and tourism revenues, followed by a 60% drop in foreign exchange reserves, a 3% drop in growth, and a rapid devaluation of the Egyptian pound.[207]\n", "Egypt's most prominent multinational companies are the Orascom Group and Raya Contact Center. The information technology (IT) sector has expanded rapidly in the past few years, with many start-ups selling outsourcing services to North America and Europe, operating with companies such as Microsoft, Oracle and other major corporations, as well as many small and medium size enterprises. Some of these companies are the Xceed Contact Center, Raya, E Group Connections and C3. The IT sector has been stimulated by new Egyptian entrepreneurs with government encouragement.[citation needed]\n", "The official language of the Republic is Arabic.[234] The spoken languages are: Egyptian Arabic (68%), Sa'idi Arabic (29%), Eastern Egyptian Bedawi Arabic (1.6%), Sudanese Arabic (0.6%), Domari (0.3%), Nobiin (0.3%), Beja (0.1%), Siwi and others.[citation needed] Additionally, Greek, Armenian and Italian, and more recently, African languages like Amharic and Tigrigna are the main languages of immigrants.\n", "Vernacular poetry is perhaps the most popular literary genre among Egyptians, represented by the works of Ahmed Fouad Negm (Fagumi), Salah Jaheen and Abdel Rahman el-Abnudi.[citation needed]\n"]